package com.leoren.liehu.Content;

/**
 * 用来储存烈狐用户协议文本内容的类
 * @author Leoren
 * @DATE 2018/5/19 18:23
 */
public class LiehuAgreeMent {

    public static final String title = "烈狐用户协议";

    public static final String content =

            "1.1 用户不得对本软件进行反向工程、反向汇编、反向编译；不得使用第三方插件干扰、修改、破坏本软件；不得利用软件可能存在的bug或规则漏洞谋取私利。\n" +
            "\n" +
            "1.2 用户不得利用虎牙的服务制作、复制、发布、传播、存储含有下列内容的信息：　\n" +
            "\n" +
            "（1）反对宪法所确定的基本原则的；\n" +
            "\n" +
            "（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；\n" +
            "\n" +
            "（3）损害国家荣誉和利益的；\n" +
            "\n" +
            "（4）煽动民族仇恨、民族歧视，破坏民族团结的；\n" +
            "\n" +
            "（5）破坏国家宗教政策，宣扬邪教和封建迷信的；\n" +
            "\n" +
            "（6）散布谣言，扰乱社会秩序，破坏社会稳定的；\n" +
            "\n" +
            "（7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；\n" +
            "\n" +
            "（8）侮辱或者诽谤他人，侵害他人合法权益的；\n" +
            "\n" +
            "（9）含有法律、行政法规禁止的其他内容的。\n" +
            "\n" +
            "1.3用户不得在虎牙直播违规进行任何诸如发布广告、销售商品的商业行为，包括但不限于以下行为：\n" +
            "\n" +
            "（1）发送宣传色情网站、成人用品网站等色情、低俗内容；\n" +
            "\n" +
            "（2）发送宣传假冒伪劣产品或未经授权销售的产品内容；\n" +
            "\n" +
            "（3）发送宣传国家明令禁止或未取得国家许可销售的产品内容；\n" +
            "\n" +
            "（4）发送宣传游戏代挂代练、虚假人气、贩卖虚拟货币等内容；\n" +
            "\n" +
            "（5）发送组织、宣传网络兼职内容；\n" +
            "\n" +
            "（6）广告形式宣传其他平台、网络游戏链接；\n" +
            "\n" +
            "（7）恶意刷屏、扰乱平台秩序；\n" +
            "\n" +
            "（8）其他违反法律法规或虎牙平台规则的内容。\n" +
            "\n" +
            "1.4 用户保证在使用虎牙时发布、传播的信息的真实性、准确性，同时保证该等信息不侵犯任何第三方的知识产权。\n" +
            "\n" +
            "1.5 用户保证在使用虎牙时遵守虎牙平台发布的其他平台规则。\n" +
            "\n" +
            "1.6 若虎牙发现用户有2.1至2.5条行为的，所有的责任由用户承担，同时虎牙有权根据违规情节，采取包括但不限于以下处罚措施：暂时封停账号、永久冻结账号、永久封停账号、回收账号、剔除违法所得、扣罚保证金或佣金等。\n" +
            "\n" +
            " \n" +
            "\n" +
            "\n" +
            "2、告知声明\n" +
            "\n" +
            "2.1 用户须明白，在使用虎牙服务的过程中可能存在来自他人包括威胁性的、诽谤性的、令人反感的或非法的内容或行为，或侵犯他人权利（包括知识产权）的匿名或冒名的信息风险，用户须承担以上风险，虎牙对服务不作担保，不论是明确的或隐含的，包括所有有关信息真实性、适商性、适于某一特定用途、所有权和非侵权性的默示担保和条件，对因此导致任何因用户不正当或非法使用服务产生的直接、间接、偶然、特殊及后续的损害，不承担任何责任。\n" +
            "\n" +
            "2.2 用户使用虎牙服务必须遵守国家有关法律和政策等，维护国家利益，保护国家安全，并遵守本条款，对于用户违法或违反本协议的使用(包括但不限于言论发表、传送等)而引起的一切责任，由用户负全部责任。\n" +
            "\n" +
            "2.3 虎牙的服务同大多数因特网产品一样，易受到各种安全问题的困扰，包括但不限于：1）透露详细个人资料，被不法分子利用，造成现实生活中的骚扰；2）哄骗、破译密码；3）下载安装的其它软件中含有“特洛伊木马”等病毒，威胁到个人计算计上信息和数据的安全，继而影响对本服务的使用。对于发生上述情况的，用户应当自行承担责任。\n" +
            "\n" +
            "2.4 用户理解，互联网技术的不稳定性，可能导致政府政策管制、病毒入侵、黑客攻击、服务器系统崩溃或者其他现今技术无法解决的风险发生，上述风险可能导致虎牙服务中断或账号道具损失，对此等非人为因素引起的损失虎牙不承担责任。\n" +
            "\n" +
            "2.5 虎牙不对发布在本网站上的广告的产品效果、宣传、信息准确性负责，用户在接触这些广告时自行判断。\n" +
            "\n" +
            "2.6 用户同意运营商向其接收信息的装置或软件包括但不限于固定电话、移动电话、电子邮箱、QQ、YY、微博、微信等发送服务信息和商业性广告。\n" +
            "\n" +
            " \n" +
            "\n" +
            "\n" +
            "3、知识产权\n" +
            "\n" +
            "3.1 虎牙的文字、图片、视频、音频、软件等元素，虎牙服务标志、标识以及专利权，虎牙对此享有上述所有内容的知识产权。\n" +
            "\n" +
            "3.2 用户使用虎牙软件服务只能在本协议以及相应的授权许可协议授权的范围使用虎牙知识产权，未经授权超范围使用的构成对虎牙的侵权。\n" +
            "\n" +
            "3.3 用户在使用虎牙软件服务时发布上传的文字、图片、视频、软件以及表演等用户原创的信息，此部分信息的知识产权归用户，但用户的发表、上传行为是对虎牙服务平台的授权，用户确认将其发表、上传的信息非独占性、永久性地授权给虎牙，该授权可转授权。虎牙可将前述信息在虎牙旗下的服务平台上使用，可再次编辑后使用，也可以由虎牙授权给合作方使用。\n" +
            "\n" +
            "3.4 若虎牙软件内的信息以及其他用户上传、存储、传播的信息有侵犯用户或第三人的知识产权的，虎牙提供投诉通道。具体详见《虎牙版权保护投诉指引》。\n" +
            "\n" +
            " \n" +
            "\n" +
            "\n" +
            "4、收费服务\n" +
            "\n" +
            "4.1 虎牙软件部分功能或应用涉及付费，用户输入帐号密码的行为视为对收费服务的接受和订阅，用户一旦接受订阅收费服务，需要按虎牙公示的收费标准支付费用。\n" +
            "\n" +
            "\n" +
            "4.2 用户在进行消费时，请事先了解消费价格及事项；如您是未成年人，请在监护人的认可后进行消费。\n" +
            "\n" +
            "4.3 用户付费后获得的权益不得继承或转让给第三人。\n" +
            "\n" +
            " \n" +
            "\n" +
            "\n" +
            "5、隐私保护\n" +
            "\n" +
            "5.1 请用户注意勿在使用虎牙软件服务中透露自己的各类财产账户、银行卡、信用卡、第三方支付账户及对应密码等重要资料，否则由此带来的任何损失由用户自行承担。\n" +
            "\n" +
            "5.2 用户在使用虎牙软件服务时不可将自认为隐私的信息发表、上传至虎牙软件，也不可将该等信息通过虎牙软件的服务传播给其他人。若用户的行为引起的隐私泄漏，由用户承担责任。\n" +
            "\n" +
            "5.3 虎牙软件在提供服务时可能会搜集用户信息，虎牙会明确告知用户，通常信息仅限于用户姓名、性别、年龄、出生日期、身份证号、家庭住址、教育程度、公司情况、所属行业、兴趣爱好等，用户同意虎牙的上述行为。\n" +
            "\n" +
            "5.4 就下列相关事宜的发生，虎牙软件不承担任何法律责任：\n" +
            "\n" +
            "（1）虎牙根据法律规定或相关政府、司法机关的要求提供您的个人信息；\n" +
            "\n" +
            "（2） 由于用户将用户密码告知他人或与他人共享注册帐户，由此导致的任何个人信息的泄漏，或其他非因虎牙原因导致的个人信息的泄漏；\n" +
            "\n" +
            "（3） 任何由于黑客攻击、电脑病毒侵入造成的信息泄漏；\n" +
            "\n" +
            "（4） 因不可抗力导致的信息泄漏。\n" +
            "\n" +
            "5.5 更多虎牙软件隐私权保护政策，请用户查看《欢聚时代集团隐私政策》。\n" +
            "\n" +
            " \n" +
            "\n" +
            "6、其他条款\n" +
            "\n" +
            "6.1 本协议条款的签订、解释以及争议的解决均适用中华人民共和国法律。\n" +
            "\n" +
            "6.2 本协议的签署地点为虎牙软件服务器所在地即广州市番禺区，若用户与虎牙发生争议的，双方同意将争议提交广州市番禺区人民法院诉讼解决。\n" +
            "\n" +
            "\n" +
            "6.3 本协议在虎牙软件公示，对用户和网站服务商虎牙具有法律约束力，用户访问本网站的行为视为对本协议的接受，对用户具有法律约束力。";


}
